%北京年份-沙尘天数
year_day = [1961,21;1964,11;1967,23;1970,15;1973,27;
    1976,43;1979,34;1982,21;1985,16;1988,24;
    1991,10;1994,5;1997,0;2000,20;2003,5;
    2006,23;2009,3;2012,1;2015,5;2018,4];

%三次多项式插值
year = 1961:1:2018;
year0 = year_day(:,1:1)';
day0 = year_day(:,2:2)';
day = interp1(year0,day0,year,'pchip');
year_day_new = [year;day]';
%两组数据有效为02-18
dust_weather_frequence_Beijing = year_day_new(42:58,2:2);

%塞罕坝pm2.5数据（02-18）
dust_stagnation_ability = [1.39369E+11,
1.33408E+11,
1.29494E+11,
1.25434E+11,
1.21273E+11,
1.19349E+11,
1.17417E+11,
1.17821E+11,
1.15981E+11,
1.16558E+11,
1.17276E+11,
1.18407E+11,
1.24837E+11,
1.04848E+11,
99042219266,
87815145600,
81191738671];

%算r1的相关性
r1= corr(pm25,year_day_new_0218, 'type' , 'Spearman');   

plot(pm25,year_day_new_0218)




